<a href="https://colab.research.google.com/github/JakeOh/202007_itw_bd18/blob/master/lab_python/python61_datetime.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

* Python datetime 모듈(datetime.py 파일)
  * datetime 클래스: 날짜(date), 시간(time)과 관련된 정보들을 저장, 메서드를 포함.

In [2]:
# import module_name
# module_name.class_name[function_name, variable_name, ...]

# from module_name import class_name[function_name, variable, ...]
# class_name[function_name, ...]

from math import sqrt
sqrt(2)

1.4142135623730951

In [3]:
import datetime  # datetime 모듈을 임포트(메모리 로드)

datetime.datetime.now()  # datetime 모듈의 datetime 클래스의 now() 메서드를 호출

datetime.datetime(2020, 10, 13, 0, 57, 13, 820884)

In [4]:
from datetime import datetime  # datetime 모듈의 datetime 클래스만 임포트(메모리 로드)

datetime.now()  # datetime 클래스의 now() 메서드를 호출.

datetime.datetime(2020, 10, 13, 0, 59, 21, 855196)

In [7]:
# datetime.now(): OS의 시간대(time zone)에서의 현재 시간을 리턴.
now = datetime.now()
print(now)  #> Google Colab 환경에서 설정된 시간대의 현재 날짜/시간 정보를 리턴 -> UTC+00:00
# UTC: Coordinate Universal Timezone
# KST: Korean Standard Timezone, 한국 표준시(UTC+09:00)

2020-10-13 01:11:16.859857

In [8]:
# datetime 생성자 함수(constructor function): 특정 날짜/시간으로 datetime 객체를 생성
date1 = datetime(year=2020, month=10, day=13)
print(date1)

2020-10-13 00:00:00

In [12]:
date2 = datetime(year=2020, month=10, day=14, hour=10, minute=17)
print(date2)

2020-10-14 10:17:00

In [13]:
print(date2 - date1)

1 day, 10:17:00

* datetime(날짜/시간) 객체 <--> str(문자열) 변환
  * `datetime.strptime(문자열, 포맷문자열)`: 문자열을 datetime 객체로 변환(parsing).
  * `datetime.strftime(포맷문자열)`: datetime 객체를 문자열로 변환(formatting)

In [19]:
now = datetime.now()
print(now)
print(now.strftime('%Y/%m/%d'))
print(now.strftime('%y/%m/%d'))
print(now.strftime('%b. %d, %y'))
print(now.strftime('%B %d, %y'))
# %Y: 4자리 연도(year), %y: 2자리 연도
# %m: 2자리 월(month), %b: 월 이름 약자, %B: 월 이름
# %d: 2자리 일(day)

2020-10-13 01:50:17.023345
2020/10/13
20/10/13
Oct. 13, 20
October 13, 20

In [26]:
date3 = datetime(2020, 10, 13, 14, 30, 0)
print(date3)
print(date3.strftime('%H:%M:%S'))
print(date3.strftime('%I:%M:%S %p'))
# %H: 24시간 형식 시간(hour), 00 ~ 23
# %I: 12시간 형식 시간(hour), 1 ~ 12
# %M: 2자리 분(minute), 00 ~ 59
# %S: 2자리 초(second), 00 ~ 59

2020-10-13 14:30:00
14:30:00
02:30:00 PM

In [29]:
print(datetime.strptime('2020-10-13', '%Y-%m-%d'))
print(datetime.strptime('20-10-13', '%y-%m-%d'))
print(datetime.strptime('20-10-13', '%d-%m-%y'))

2020-10-13 00:00:00
2020-10-13 00:00:00
2013-10-20 00:00:00

* timestamp(UNIX time, POSIX time, epoch time, ...):
  1970년 1월 1일 0시 0분 0초를 시작으로 해서 1초마다 1씩 증가하는 숫자.
* `datetime.timestamp()`: datetime 객체 -> timestamp(숫자)
* `datetime.fromtimestamp(숫자)`: timestamp(숫자) -> datetime 객체.

In [36]:
now = datetime.now()
print(now)
print(now.timestamp())
print(datetime.fromtimestamp(1602556762))

2020-10-13 02:40:31.926031
1602556831.926031
2020-10-13 02:39:22

* https://github.com/wesm/pydata-book/tree/2nd-edition/datasets/movielens/
의 데이터 파일 중 ratings.dat 파일을 읽어서 데이터 프레임을 생성.
* 데이터 프레임에 dt 컬럼을 추가 - timestamp 컬럼의 숫자들을 datetime 객체로 변환한 값을 저장.

In [39]:
import pandas as pd

data_file = 'https://github.com/wesm/pydata-book/blob/2nd-edition/datasets/movielens/ratings.dat?raw=true'
ratings = pd.read_csv(data_file,
                      sep='::',
                      header=None,
                      names=['user_id', 'movie_id', 'rating', 'timestamp'])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:7: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  import sys

In [40]:
ratings.head()

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [41]:
print(datetime.fromtimestamp(978300760))

2000-12-31 22:12:40

In [42]:
ratings.tail()

         user_id  movie_id  rating  timestamp
1000204     6040      1091       1  956716541
1000205     6040      1094       5  956704887
1000206     6040       562       5  956704746
1000207     6040      1096       4  956715648
1000208     6040      1097       4  956715569

In [43]:
print(datetime.fromtimestamp(956715569))

2000-04-26 02:19:29

In [47]:
dates = []  # timestamp를 datetime 객체로 변환한 값들을 저장할 리스트
for ts in ratings['timestamp']:  # timestamp 컬럼의 값들을 반복하면서
    dt = datetime.fromtimestamp(ts)  # timestamp(숫자)를 datetime 객체로 변환.
    dates.append(dt)  # 변환된 datetime 객체를 리스트에 추가.

# dates 리스트를 pd.Series로 변환 후, 데이터 프레임의 새로운 컬럼으로 추가.
ratings['dt'] = pd.Series(dates)

In [48]:
ratings.head()

   user_id  movie_id  rating  timestamp                  dt
0        1      1193       5  978300760 2000-12-31 22:12:40
1        1       661       3  978302109 2000-12-31 22:35:09
2        1       914       3  978301968 2000-12-31 22:32:48
3        1      3408       4  978300275 2000-12-31 22:04:35
4        1      2355       5  978824291 2001-01-06 23:38:11

In [46]:
ratings.tail()

         user_id  movie_id  rating  timestamp                  dt
1000204     6040      1091       1  956716541 2000-04-26 02:35:41
1000205     6040      1094       5  956704887 2000-04-25 23:21:27
1000206     6040       562       5  956704746 2000-04-25 23:19:06
1000207     6040      1096       4  956715648 2000-04-26 02:20:48
1000208     6040      1097       4  956715569 2000-04-26 02:19:29

In [49]:
ratings.dtypes

user_id               int64
movie_id              int64
rating                int64
timestamp             int64
dt           datetime64[ns]
dtype: object

In [50]:
ratings['timestamp'].min(), ratings['timestamp'].max()

(956703932, 1046454590)

In [53]:
ratings['dt'].min(), ratings['dt'].max()

(Timestamp('2000-04-25 23:05:32'), Timestamp('2003-02-28 17:49:50'))

* datetime 객체에서 날짜/시간 정보 추출하는 방법

In [59]:
now = datetime.now()
print(now)
print(now.year, now.month, now.day, now.hour, now.minute, now.second)

2020-10-13 04:56:59.358241
2020 10 13 4 56 59

* datetime 객체를 저장하는 Series에서 날짜/시간 정보를 추출하는 방법:
  pandas.Series.dt.속성[메서드, ...]

In [66]:
ratings['dt'].dt.year

0          2000
1          2000
2          2000
3          2000
4          2001
           ...
1000204    2000
1000205    2000
1000206    2000
1000207    2000
1000208    2000
Name: dt, Length: 1000209, dtype: int64

* ratings 데이터 프레임에 year, month, quarter(분기) 컬럼을 추가

In [68]:
ratings['year'] = ratings['dt'].dt.year
ratings['month'] = ratings['dt'].dt.month
ratings['quarter'] = ratings['dt'].dt.quarter

ratings.head()

   user_id  movie_id  rating  ...  year month  quarter
0        1      1193       5  ...  2000    12        4
1        1       661       3  ...  2000    12        4
2        1       914       3  ...  2000    12        4
3        1      3408       4  ...  2000    12        4
4        1      2355       5  ...  2001     1        1

[5 rows x 8 columns]

In [69]:
ratings.tail()

         user_id  movie_id  rating  ...  year month  quarter
1000204     6040      1091       1  ...  2000     4        2
1000205     6040      1094       5  ...  2000     4        2
1000206     6040       562       5  ...  2000     4        2
1000207     6040      1096       4  ...  2000     4        2
1000208     6040      1097       4  ...  2000     4        2

[5 rows x 8 columns]

* ratings 데이터 프레임에서 2003년 2월 데이터만 추출

In [70]:
ratings[(ratings['dt'].dt.year == 2003) & 
        (ratings['dt'].dt.month == 2)]

        user_id  movie_id  rating  ...  year month  quarter
27759       195      1254       4  ...  2003     2        1
27764       195      1183       3  ...  2003     2        1
27781       195      3007       4  ...  2003     2        1
27846       195      1356       2  ...  2003     2        1
27895       195      2247       2  ...  2003     2        1
...         ...       ...     ...  ...   ...   ...      ...
984842     5950      3317       3  ...  2003     2        1
984847     5950      3328       3  ...  2003     2        1
984849     5950       111       5  ...  2003     2        1
984861     5950      3363       5  ...  2003     2        1
984905     5950      1089       3  ...  2003     2        1

[1496 rows x 8 columns]

* ratings 데이터 프레임에서 2002년 1분기 데이터만 추출

In [71]:
ratings[(ratings['year'] == 2002) &
        (ratings['quarter'] == 1)]

        user_id  movie_id  rating  ...  year month  quarter
5025         36      3359       5  ...  2002     3        1
5034         36       581       4  ...  2002     3        1
5053         36         7       4  ...  2002     2        1
5060         36      1191       4  ...  2002     3        1
5073         36      1912       5  ...  2002     3        1
...         ...       ...     ...  ...   ...   ...      ...
994088     6002      2764       4  ...  2002     2        1
994092     6002      3729       4  ...  2002     2        1
994096     6002      3733       4  ...  2002     2        1
994100     6002      2013       4  ...  2002     2        1
994106     6002      1084       5  ...  2002     2        1

[8166 rows x 8 columns]